namespace home10c_
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //            დავალება 1

            //შექმენით IOutput2 ინტერფეისი.ის უნდა შეიცავდეს ორ მეთოდს:

            //void ShowEven() -აჩვენებს ლუწ მნიშვნელობებს მონაცემთა კონტეინერიდან;
            //void ShowOdd() -აჩვენებს კენტ მნიშვნელობებს მონაცემთა კონტეინერიდან;

            //კლასმა “Array”-მ, იმპლემენტირება უნდა გაუკეთოს IOutput2 ინტერფეისს.

            //ShowEven მეთოდი ნებისმიერი მასივიდან ლუწ მნიშვნელობებს აჩვენებს.
            //ShowOdd მეთოდი ნებისმერი მასივიდან კენტ მნიშვნელობებს აჩვენებს.

            //დაწერეთ კოდი მიღებული ფუნქციონალის ტესტირებისათვის.



//            დავალება 2
//შექმენით ICalc2 ინტერფეისი.ის უნდა შეიცავდეს ორ მეთოდს:
//int CountDistinct() -აბრუნებს კონტეინერში არსებული უნიკალური მნიშვნელობების რაოდენობას.
//int EqualToValue(int valueToCompare) -აბრუნებს მნიშვნელობების რაოდენეობას, რომელიც ტოლია
//valueToCompare - ისა.
//კლასმა “Array”-მ, იმპლემენტირება უნდა გაუკეთოს ICalc2 ინტერფეისს.
//CountDistinct მეთოდი აბრუნებს მასივში არსებული უნიკალური მნიშვნელობების რაოდენობას.
//EqualToValue მეთოდი აბრუნებს მასივში არსებული მნიშვნელობების რაოდენობებს, რომელიც ტოლია
//‘valueToCompare’-ისა.
//დაწერეთ კოდი მიღებული ფუნქციონალის ტესტირებისათვის.





        }
    }
}
